#ifndef _asrpro_h_
#define _asrpro_h_

#include <stdbool.h>

// ! ========================= 接 口 变 量 / Typedef 声 明 ========================= ! //

/**
 * @brief AsrPro 语音播报指令
 * @note 采用直接赋值的方式对应十六进制报文的第5个字节(命令ID)
 */
typedef enum {
    TEAM_INTRO = 0x00, // 大家好，我们是来自华南农业大学的守望紫荆队！

    Y_000 = 0x01,      // 从上到下依次为: 雌花、雌花、雌花
    Y_001 = 0x02,      // 从上到下依次为: 雌花、雌花、雄花
    Y_010 = 0x03,      // 从上到下依次为: 雌花、雄花、雌花
    Y_011 = 0x04,      // 从上到下依次为: 雌花、雄花、雄花
    Y_100 = 0x05,      // 从上到下依次为: 雄花、雌花、雌花
    Y_101 = 0x06,      // 从上到下依次为: 雄花、雌花、雄花
    Y_110 = 0x07,      // 从上到下依次为: 雄花、雄花、雌花
    Y_111 = 0x08,      // 从上到下依次为: 雄花、雄花、雄花

    X_000 = 0x09,      // 从左到右依次为: 雌花、雌花、雌花
    X_001 = 0x0A,      // 从左到右依次为: 雌花、雌花、雄花
    X_010 = 0x0B,      // 从左到右依次为: 雌花、雄花、雌花
    X_011 = 0x0C,      // 从左到右依次为: 雌花、雄花、雄花
    X_100 = 0x0D,      // 从左到右依次为: 雄花、雌花、雌花
    X_101 = 0x0E,      // 从左到右依次为: 雄花、雌花、雄花
    X_110 = 0x0F,      // 从左到右依次为: 雄花、雄花、雌花
    X_111 = 0x10,      // 从左到右依次为: 雄花、雄花、雄花

    // --- 新增的四个情况 ---
    X_00  = 0x11,      // 从左到右依次为: 雌花、雌花
    X_01  = 0x12,      // 从左到右依次为: 雌花、雄花
    X_10  = 0x13,      // 从左到右依次为: 雄花、雌花
    X_11  = 0x14,      // 从左到右依次为: 雄花、雄花

    MAX,
} AsrProCmd;

// ! ========================= 接 口 函 数 声 明 ========================= ! //

bool asrpro_broadcast(AsrProCmd cmd);

#endif